## 1. Charger vos données dans un DataFrame Pandas

In [3]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [5]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

df = pd.read_csv("Titanic.csv")
df.head()

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1

 ## 2. Nettoyer votre Dataset avec drop(), dropna() et fillna()

In [ ]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

df = pd.read_csv("Titanic.csv")
df.head()

## 3. Groupby() et value_counts()

In [ ]:
3 Créer des catégories d'ages avec la fonction map() de pandas
- Créer des catégories de genres avec cat.codes